#!/usr/bin/env python

# Make a program that displays the lyrics of a song.

lyrics='''हाँ यही रास्ता है
तेरा तूने अब जाना है
हाँ यही सपना है
तेरा तूने पहचाना है
हाँ यही रास्ता है
तेरा तूने अब जाना है
हाँ यही सपना है
तेरा तूने पहचाना है
तुझे अब ये दिखाना है
रोके तुझको आँधियाँ
या ज़मीन और आसमान
पायेगा जो लक्ष्य है तेरा
लक्ष्य तोह हर हाल में पाना है
हो हो हो हो हो हो हो हो हो हो हो
मुश्किल कोई आजाये तोह
पर्बत कोई टकराये तोह
ताक़त कोई दिखलाये तोह
तूफ़ान कोई मण्डलाये तोह
मुश्किल कोई आजाये तोह
पर्बत कोई टकराये तोह
बरसे चाहे अम्बर से आग
लिपटे चाहे पैरों से लाख
बरसे चाहे अम्बर से आग
लिपटे चाहे पैरों से नाग
पायेगा जो लक्ष्य है तेरा
लक्ष्य तोह हर हाल में पाना है
हिम्मत से जो कोई चले
धरती हिले क़दमों तले
क्या दूरियां क्या फ़ासले
मंज़िल लगे आके गले
हिम्मत से जो कोई चले
धरती हिले क़दमों तले
तू चल यूँही अब सुब हो शाम
रुकना झुकना नहीं तेरा काम
तू चल यूँही अब सुब हो शाम
रुकना झुकना नहीं तेरा काम
पायेगा जो लक्ष्य है तेरा
लक्ष्य तोह हर हाल में पाना है
हो हो हो हो हो हो हो हो हो हो हो
हाँ यही रास्ता है
तेरा तूने अब जाना है
हाँ यही सपना है
तेरा तूने पहचाना है
तुझे अब ये दिखाना है
हो हो हो हो हो हो हो हो हो हो हो
'''

print(lyrics)